Terraform plan in __.__
<details>
  <summary>Plan: 2 to add, 1 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.dashboard.module.web.aws_instance.web[0] is tainted, so must be replaced
+/- resource "aws_instance" "web" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:587807691409:instance/i-062b6c646f4024c9e" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "*******************" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "*********************" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-167.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.167" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name"  = "dashboard-web1tf"
            "env"   = "sandbox"
            "group" = "dashboard_web"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "********" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "*********************" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # module.dashboard.module.web.aws_instance.web[0] (deposed object 08c0313c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "web" {
      - ami                                  = "ami-085925f297f89fce1" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:587807691409:instance/i-01a8981ee41d9991b" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-01a8981ee41d9991b" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "datagov-sandbox" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0160b4a03504e1032" -> null
      - private_dns                          = "ip-10-0-1-66.ec2.internal" -> null
      - private_ip                           = "10.0.1.66" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0bbe8705ad1ce9a08" -> null
      - tags                                 = {
          - "Name"  = "dashboard-web1tf"
          - "env"   = "sandbox"
          - "group" = "dashboard_web"
        } -> null
      - tags_all                             = {
          - "Name"  = "dashboard-web1tf"
          - "env"   = "sandbox"
          - "group" = "dashboard_web"
        } -> null
      - tenancy                              = "default" -> null
      - volume_tags                          = {} -> null
      - vpc_security_group_ids               = [
          - "sg-01465b85df2ea8e05",
          - "sg-0599014293c0c3234",
          - "sg-06d027616535125d5",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0add9fabb017d3135" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.dashboard.module.web.aws_instance.web[0] (deposed object 7d4257ce) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "web" {
      - ami                                  = "ami-0cfc05f17eac80275" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:587807691409:instance/i-007c425f1f1bb10d5" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-007c425f1f1bb10d5" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "datagov-sandbox" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0285c2de19afb235d" -> null
      - private_dns                          = "ip-10-0-1-204.ec2.internal" -> null
      - private_ip                           = "10.0.1.204" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0bbe8705ad1ce9a08" -> null
      - tags                                 = {
          - "Name"  = "dashboard-web1tf"
          - "env"   = "sandbox"
          - "group" = "dashboard_web"
        } -> null
      - tags_all                             = {
          - "Name"  = "dashboard-web1tf"
          - "env"   = "sandbox"
          - "group" = "dashboard_web"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-01465b85df2ea8e05",
          - "sg-0599014293c0c3234",
          - "sg-06d027616535125d5",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ba6c274eed62e2ba" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.dashboard.module.web.aws_lb_target_group_attachment.lb[0] will be created
  + resource "aws_lb_target_group_attachment" "lb" {
      + id               = (known after apply)
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/dashboard-web-sandbox/43eae2b2e421ab6e"
      + target_id        = (known after apply)
    }

  # module.dashboard.module.web.aws_route53_record.web[0] will be updated in-place
  ~ resource "aws_route53_record" "web" {
        id      = "Z1006361VZ0GA3BRODCA_dashboard-web1tf_CNAME"
        name    = "dashboard-web1tf"
      ~ records = [
          - "ip-10-0-1-66.ec2.internal",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 3 to destroy.
```
</details>

Plan generated in [plan #43](https://github.com/GSA/datagov-infrastructure-live/actions/runs/1234178883)